-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Май 29 2026 г., 11:21
-- Версия сервера: 10.4.28-MariaDB
-- Версия PHP: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `community`
--

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `video_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `video_id`, `user_id`, `text`, `created_at`) VALUES
(1, 12, 1, 'вв', '2026-05-10 17:22:24'),
(2, 12, 1, 'мзлсщвлс', '2026-05-10 17:22:28'),
(3, 8, 1, 'мя', '2026-05-10 20:41:05'),
(4, 10, 1, 'влсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутслвлсьвьслдвсвьзысбвьл. со сотсовтоствоство❤️сьутсл😈', '2026-05-14 07:42:30'),
(5, 26, 28, 'rjvvtynfhq', '2026-05-15 10:52:43'),
(6, 28, 32, 'круто бро', '2026-05-16 15:23:17'),
(7, 4, 32, 'мне реально было интересно', '2026-05-16 15:24:08'),
(8, 11, 1, 'rjvvtynsndnf', '2026-05-21 10:06:41');

-- --------------------------------------------------------

--
-- Структура таблицы `email_verifications`
--

CREATE TABLE `email_verifications` (
  `id` int(11) NOT NULL,
  `email` varchar(100) NOT NULL,
  `code` varchar(6) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `email_verifications`
--

INSERT INTO `email_verifications` (`id`, `email`, `code`, `created_at`) VALUES
(50, 'scjnj@gmail.com', '352211', '2026-05-19 09:08:17'),
(52, 'adjwd@gmail.com', '424424', '2026-05-19 11:22:04'),
(53, 'skfj@gmail.com', '376037', '2026-05-19 11:38:11'),
(55, 'aoijd@gmail.com', '449456', '2026-05-19 11:41:58');

-- --------------------------------------------------------

--
-- Структура таблицы `playlists`
--

CREATE TABLE `playlists` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_private` tinyint(1) DEFAULT 0,
  `type` enum('custom','liked','watch_later','history') DEFAULT 'custom'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `playlists`
--

INSERT INTO `playlists` (`id`, `user_id`, `title`, `created_at`, `is_private`, `type`) VALUES
(1, 1, 'Понравившееся', '2026-03-23 13:04:27', 1, 'liked'),
(2, 1, 'Смотреть позже', '2026-03-23 13:04:27', 1, 'watch_later'),
(3, 1, 'мой плейлист', '2026-03-24 09:15:38', 1, 'custom'),
(4, 1, 'приватный', '2026-03-24 09:22:35', 1, 'custom'),
(5, 2, 'Понравившееся', '2026-03-24 09:24:14', 1, 'liked'),
(6, 2, 'Смотреть позже', '2026-03-24 09:24:14', 1, 'watch_later'),
(7, 9, 'Понравившееся', '2026-03-24 09:29:36', 1, 'liked'),
(8, 9, 'Смотреть позже', '2026-03-24 09:29:36', 1, 'watch_later'),
(13, 16, 'Понравившееся', '2026-03-26 11:39:49', 1, 'liked'),
(14, 16, 'Смотреть позже', '2026-03-26 11:39:49', 1, 'watch_later'),
(17, 17, 'Понравившееся', '2026-03-28 18:33:28', 1, 'liked'),
(18, 17, 'Смотреть позже', '2026-03-28 18:33:28', 1, 'watch_later'),
(19, 18, 'Понравившееся', '2026-03-29 07:25:46', 1, 'liked'),
(20, 18, 'Смотреть позже', '2026-03-29 07:25:46', 1, 'watch_later'),
(23, 19, 'Понравившееся', '2026-03-31 12:11:04', 1, 'liked'),
(24, 19, 'Смотреть позже', '2026-03-31 12:11:04', 1, 'watch_later'),
(25, 19, 'обязательно посмотреть', '2026-03-31 12:11:46', 0, 'custom'),
(26, 19, 'ня', '2026-03-31 12:12:07', 1, 'custom'),
(27, 20, 'Понравившееся', '2026-04-01 05:17:45', 1, 'liked'),
(28, 20, 'Смотреть позже', '2026-04-01 05:17:45', 1, 'watch_later'),
(29, 20, 'Новый плейлист', '2026-04-01 05:19:21', 0, 'custom'),
(30, 20, 'мяу', '2026-04-01 05:19:45', 0, 'custom'),
(31, 18, 'создаь', '2026-04-01 12:38:47', 0, 'custom'),
(32, 21, 'Понравившееся', '2026-04-03 07:14:33', 1, 'liked'),
(33, 21, 'Смотреть позже', '2026-04-03 07:14:33', 1, 'watch_later'),
(34, 21, 'yjdsq', '2026-04-03 07:15:33', 1, 'custom'),
(35, 21, 'lzlzlz', '2026-04-03 07:15:47', 0, 'custom'),
(36, 22, 'Понравившееся', '2026-04-07 07:04:06', 1, 'liked'),
(37, 22, 'Смотреть позже', '2026-04-07 07:04:06', 1, 'watch_later'),
(38, 22, 'meow', '2026-04-07 07:05:20', 0, 'custom'),
(39, 23, 'Понравившееся', '2026-04-07 10:21:27', 1, 'liked'),
(40, 23, 'Смотреть позже', '2026-04-07 10:21:27', 1, 'watch_later'),
(41, 23, 'egor', '2026-04-07 10:22:13', 0, 'custom'),
(42, 23, 'приватный', '2026-04-07 10:23:02', 1, 'custom'),
(43, 24, 'Понравившееся', '2026-04-28 08:19:43', 1, 'liked'),
(44, 24, 'Смотреть позже', '2026-04-28 08:19:43', 1, 'watch_later'),
(46, 1, 'kjn', '2026-05-07 10:13:47', 0, 'custom'),
(49, 25, 'Понравившееся', '2026-05-09 12:12:05', 1, 'liked'),
(50, 25, 'Смотреть позже', '2026-05-09 12:12:05', 1, 'watch_later'),
(52, 25, 'diodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodio', '2026-05-09 12:18:17', 1, 'custom'),
(53, 25, 'dfdiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodiodio', '2026-05-09 12:18:34', 0, 'custom'),
(55, 25, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(56, 23, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(57, 1, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(58, 22, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(59, 9, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(60, 2, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(62, 17, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(63, 20, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(64, 21, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(65, 16, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(66, 24, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(67, 19, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(68, 18, 'История просмотров', '2026-05-13 10:53:59', 1, 'history'),
(70, 26, 'История просмотров', '2026-05-13 20:37:29', 1, 'history'),
(71, 26, 'История просмотров', '2026-05-13 20:37:29', 1, 'history'),
(76, 28, 'История просмотров', '2026-05-15 10:46:25', 1, 'history'),
(77, 28, 'Понравившееся', '2026-05-15 10:47:17', 1, 'liked'),
(78, 28, 'новый', '2026-05-15 10:47:36', 1, 'custom'),
(79, 28, 'Смотреть позже', '2026-05-15 10:47:44', 1, 'watch_later'),
(80, 30, 'Понравившееся', '2026-05-15 11:33:54', 1, 'liked'),
(81, 30, 'Смотреть позже', '2026-05-15 11:33:55', 1, 'watch_later'),
(82, 30, 'История просмотров', '2026-05-15 11:34:26', 1, 'history'),
(83, 30, 'История просмотров', '2026-05-15 11:34:26', 1, 'history'),
(84, 30, 'гргнп', '2026-05-15 11:35:21', 1, 'custom'),
(85, 32, 'История просмотров', '2026-05-16 15:20:49', 1, 'history'),
(86, 32, 'История просмотров', '2026-05-16 15:20:49', 1, 'history'),
(87, 32, 'Понравившееся', '2026-05-16 15:24:41', 1, 'liked'),
(88, 1, 'новый', '2026-05-19 20:12:23', 0, 'custom'),
(89, 38, 'История просмотров', '2026-05-21 08:58:48', 1, 'history');

-- --------------------------------------------------------

--
-- Структура таблицы `playlist_saves`
--

CREATE TABLE `playlist_saves` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `playlist_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `playlist_saves`
--

INSERT INTO `playlist_saves` (`id`, `user_id`, `playlist_id`, `created_at`) VALUES
(6, 28, 46, '2026-05-15 10:47:02'),
(7, 30, 46, '2026-05-15 11:33:44'),
(8, 32, 46, '2026-05-16 15:26:00'),
(9, 1, 41, '2026-05-19 20:25:28'),
(11, 1, 31, '2026-05-28 09:43:18');

-- --------------------------------------------------------

--
-- Структура таблицы `playlist_videos`
--

CREATE TABLE `playlist_videos` (
  `id` int(11) NOT NULL,
  `playlist_id` int(11) NOT NULL,
  `video_id` int(11) NOT NULL,
  `added_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `playlist_videos`
--

INSERT INTO `playlist_videos` (`id`, `playlist_id`, `video_id`, `added_at`) VALUES
(4, 4, 4, '2026-03-24 09:47:08'),
(5, 3, 2, '2026-03-24 09:57:10'),
(6, 4, 2, '2026-03-24 09:57:20'),
(7, 3, 4, '2026-03-24 11:49:06'),
(8, 3, 5, '2026-03-25 10:13:17'),
(12, 1, 3, '2026-03-25 10:13:46'),
(16, 8, 5, '2026-03-27 18:22:19'),
(17, 7, 5, '2026-03-27 18:22:25'),
(18, 2, 4, '2026-03-27 18:27:17'),
(25, 17, 7, '2026-03-28 18:38:07'),
(26, 19, 7, '2026-03-29 07:26:10'),
(27, 20, 7, '2026-03-29 07:26:13'),
(39, 2, 9, '2026-03-30 13:00:14'),
(49, 25, 9, '2026-03-31 12:11:46'),
(53, 27, 10, '2026-04-01 05:19:27'),
(54, 28, 9, '2026-04-01 05:19:31'),
(55, 29, 8, '2026-04-01 05:19:36'),
(56, 30, 7, '2026-04-01 05:19:45'),
(57, 19, 9, '2026-04-01 12:38:34'),
(58, 31, 9, '2026-04-01 12:38:47'),
(59, 20, 2, '2026-04-01 12:47:29'),
(60, 20, 3, '2026-04-01 12:55:56'),
(61, 32, 10, '2026-04-03 07:15:36'),
(62, 33, 10, '2026-04-03 07:15:39'),
(63, 34, 10, '2026-04-03 07:15:42'),
(64, 35, 10, '2026-04-03 07:15:47'),
(65, 36, 10, '2026-04-07 07:05:08'),
(66, 37, 10, '2026-04-07 07:05:10'),
(67, 38, 10, '2026-04-07 07:05:21'),
(68, 41, 10, '2026-04-07 10:22:13'),
(69, 39, 10, '2026-04-07 10:22:19'),
(70, 40, 10, '2026-04-07 10:22:21'),
(72, 43, 10, '2026-04-28 08:20:14'),
(73, 37, 11, '2026-05-07 07:32:57'),
(80, 2, 2, '2026-05-07 08:20:37'),
(84, 2, 10, '2026-05-07 08:57:41'),
(85, 46, 11, '2026-05-07 10:13:47'),
(89, 50, 12, '2026-05-09 12:14:23'),
(90, 52, 12, '2026-05-09 12:18:27'),
(93, 3, 12, '2026-05-10 20:12:33'),
(96, 3, 7, '2026-05-10 20:13:03'),
(97, 3, 9, '2026-05-10 20:13:03'),
(102, 46, 4, '2026-05-10 20:18:45'),
(103, 46, 5, '2026-05-10 20:18:45'),
(105, 46, 9, '2026-05-10 20:18:45'),
(106, 46, 7, '2026-05-10 20:18:45'),
(108, 4, 12, '2026-05-10 20:36:44'),
(110, 1, 8, '2026-05-10 20:43:58'),
(112, 1, 10, '2026-05-13 11:43:43'),
(113, 57, 11, '2026-05-21 10:06:37'),
(121, 57, 12, '2026-05-20 06:45:18'),
(135, 57, 5, '2026-05-13 11:50:20'),
(137, 57, 7, '2026-05-13 11:50:21'),
(139, 57, 10, '2026-05-28 09:42:09'),
(161, 57, 9, '2026-05-19 20:32:18'),
(177, 70, 12, '2026-05-14 07:35:15'),
(178, 71, 12, '2026-05-13 20:37:29'),
(181, 70, 11, '2026-05-14 07:35:21'),
(249, 57, 3, '2026-05-15 09:48:37'),
(285, 4, 11, '2026-05-15 09:34:10'),
(294, 57, 8, '2026-05-15 14:44:44'),
(308, 76, 11, '2026-05-15 10:46:37'),
(313, 76, 5, '2026-05-15 10:47:18'),
(315, 77, 5, '2026-05-15 10:47:17'),
(317, 78, 12, '2026-05-15 10:47:40'),
(318, 79, 12, '2026-05-15 10:47:44'),
(319, 76, 26, '2026-05-15 10:52:39'),
(325, 76, 4, '2026-05-15 10:51:14'),
(332, 81, 12, '2026-05-15 11:33:55'),
(333, 82, 10, '2026-05-15 11:34:31'),
(334, 83, 10, '2026-05-15 11:34:26'),
(335, 80, 10, '2026-05-15 11:34:31'),
(341, 82, 5, '2026-05-15 11:34:56'),
(344, 82, 27, '2026-05-15 11:42:54'),
(346, 82, 4, '2026-05-15 11:38:50'),
(364, 82, 3, '2026-05-15 11:43:50'),
(366, 82, 7, '2026-05-15 12:06:48'),
(368, 82, 9, '2026-05-15 11:49:35'),
(370, 82, 11, '2026-05-15 12:06:55'),
(372, 82, 12, '2026-05-15 12:00:00'),
(376, 82, 1, '2026-05-15 11:49:12'),
(382, 82, 28, '2026-05-15 12:06:50'),
(392, 70, 10, '2026-05-15 14:34:31'),
(406, 57, 27, '2026-05-15 14:50:36'),
(446, 57, 28, '2026-05-20 07:18:01'),
(450, 85, 11, '2026-05-16 15:20:49'),
(451, 86, 11, '2026-05-16 15:20:49'),
(452, 85, 28, '2026-05-16 15:22:58'),
(454, 85, 9, '2026-05-16 15:23:32'),
(456, 85, 4, '2026-05-16 15:23:49'),
(458, 85, 10, '2026-05-16 15:24:41'),
(460, 87, 10, '2026-05-16 15:24:41'),
(462, 87, 7, '2026-05-16 15:24:50'),
(464, 57, 29, '2026-05-19 20:12:28'),
(488, 46, 29, '2026-05-19 15:38:26'),
(495, 2, 29, '2026-05-19 15:43:28'),
(543, 2, 28, '2026-05-19 16:40:20'),
(597, 70, 29, '2026-05-21 09:04:38'),
(613, 56, 11, '2026-05-21 10:35:24'),
(624, 5, 11, '2026-05-21 10:36:37'),
(625, 6, 11, '2026-05-21 10:36:39'),
(626, 65, 12, '2026-05-21 10:47:45'),
(630, 56, 10, '2026-05-26 13:35:08'),
(632, 56, 12, '2026-05-26 13:35:52'),
(637, 56, 29, '2026-05-28 09:36:41'),
(639, 39, 29, '2026-05-28 09:36:41'),
(643, 88, 28, '2026-05-28 09:42:55'),
(644, 88, 11, '2026-05-28 09:42:55'),
(645, 88, 27, '2026-05-28 09:42:55');

-- --------------------------------------------------------

--
-- Структура таблицы `promo_codes`
--

CREATE TABLE `promo_codes` (
  `id` int(11) NOT NULL,
  `code` varchar(20) NOT NULL,
  `type` enum('unique','shared') NOT NULL DEFAULT 'unique',
  `duration_days` int(11) DEFAULT 30,
  `is_used` tinyint(1) DEFAULT 0,
  `used_by` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `promo_codes`
--

INSERT INTO `promo_codes` (`id`, `code`, `type`, `duration_days`, `is_used`, `used_by`, `created_at`) VALUES
(1, 'COMM-A2C1-7694', 'unique', 30, 1, 1, '2026-03-31 14:34:54'),
(2, 'COMM-26FF-BD7A', 'unique', 30, 1, 20, '2026-03-31 14:37:33'),
(3, 'COMM-A6AB-98ED', 'unique', 30, 0, NULL, '2026-03-31 14:37:33'),
(4, 'COMM-671C-CE25', 'unique', 30, 0, NULL, '2026-03-31 14:37:33'),
(5, 'COMM-AD86-410E', 'unique', 30, 0, NULL, '2026-03-31 14:37:33'),
(6, 'COMM-8044-F80D', 'unique', 30, 0, NULL, '2026-03-31 14:38:58'),
(7, 'COMM-6DB7-E23B', 'unique', 30, 1, NULL, '2026-04-03 07:17:59'),
(8, 'COMM-3F1B-C856', 'unique', 30, 0, NULL, '2026-04-03 07:17:59'),
(9, 'COMM-FB1D-2DAE', 'unique', 30, 0, NULL, '2026-04-03 07:17:59'),
(10, 'COMM-A67D-F44C', 'unique', 30, 0, NULL, '2026-04-07 07:09:32'),
(11, 'COMM-C067-5F7B', 'unique', 30, 0, NULL, '2026-04-07 07:09:32'),
(12, 'COMM-3D19-D01C', 'unique', 30, 0, NULL, '2026-04-07 07:09:32'),
(13, 'COMM-345D-715F', 'unique', 30, 0, NULL, '2026-04-07 07:09:33'),
(14, 'COMM-6C5E-3653', 'unique', 30, 0, NULL, '2026-04-07 10:27:13'),
(15, 'COMM-9F26-3EB2', 'unique', 30, 0, NULL, '2026-04-07 10:27:14'),
(16, 'COMM-AB52-C1B8', 'unique', 30, 0, NULL, '2026-04-07 10:27:14'),
(17, 'COMM-FREE30DAYS', 'shared', 30, 0, NULL, '2026-05-15 09:03:58'),
(18, 'COMM-0079-CE7C', 'unique', 30, 0, NULL, '2026-05-16 15:37:34'),
(19, 'COMM-8E69-8055', 'unique', 30, 0, NULL, '2026-05-16 15:37:34'),
(20, 'COMM-FE0B-B9E6', 'unique', 30, 0, NULL, '2026-05-16 15:37:35'),
(21, 'COMM-A5F7-AE8A', 'unique', 30, 0, NULL, '2026-05-21 13:18:16'),
(22, 'COMM-19FC-45B3', 'unique', 30, 0, NULL, '2026-05-21 13:18:16'),
(23, 'COMM-905E-3DB6', 'unique', 30, 0, NULL, '2026-05-21 13:18:17'),
(24, 'COMM-0096-9708', 'unique', 30, 0, NULL, '2026-05-21 13:21:49');

-- --------------------------------------------------------

--
-- Структура таблицы `promo_usages`
--

CREATE TABLE `promo_usages` (
  `id` int(11) NOT NULL,
  `promo_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `used_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `promo_usages`
--

INSERT INTO `promo_usages` (`id`, `promo_id`, `user_id`, `used_at`) VALUES
(1, 17, 1, '2026-05-15 09:09:09'),
(2, 17, 26, '2026-05-15 09:09:51'),
(3, 17, 28, '2026-05-15 10:51:37'),
(4, 17, 30, '2026-05-15 11:42:29');

-- --------------------------------------------------------

--
-- Структура таблицы `reports`
--

CREATE TABLE `reports` (
  `id` int(11) NOT NULL,
  `reporter_id` int(11) NOT NULL,
  `target_id` int(11) NOT NULL,
  `target_type` enum('video','user') NOT NULL,
  `reason` text NOT NULL,
  `status` enum('new','resolved','ignored') DEFAULT 'new',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `settings`
--

CREATE TABLE `settings` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `settings`
--

INSERT INTO `settings` (`setting_key`, `setting_value`) VALUES
('sub_price', '300');

-- --------------------------------------------------------

--
-- Структура таблицы `subscriptions`
--

CREATE TABLE `subscriptions` (
  `id` int(11) NOT NULL,
  `follower_id` int(11) NOT NULL,
  `followed_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `subscriptions`
--

INSERT INTO `subscriptions` (`id`, `follower_id`, `followed_id`, `created_at`) VALUES
(3, 2, 1, '2026-03-23 09:35:50'),
(7, 1, 2, '2026-03-23 12:32:14'),
(8, 9, 1, '2026-03-23 12:35:07'),
(10, 20, 1, '2026-04-01 05:18:38'),
(11, 20, 18, '2026-04-01 05:25:12'),
(12, 18, 1, '2026-04-01 12:47:24'),
(13, 18, 2, '2026-04-01 12:53:56'),
(15, 21, 1, '2026-04-03 07:15:03'),
(16, 22, 1, '2026-04-07 07:04:43'),
(17, 22, 18, '2026-04-07 07:05:48'),
(18, 23, 1, '2026-04-07 10:22:33'),
(19, 23, 18, '2026-04-07 10:23:17'),
(20, 23, 2, '2026-04-07 10:23:21'),
(21, 24, 1, '2026-04-28 08:20:52'),
(23, 25, 23, '2026-05-09 12:14:55'),
(24, 16, 2, '2026-05-09 12:35:20'),
(25, 1, 23, '2026-05-10 17:47:28'),
(26, 26, 1, '2026-05-13 20:37:28'),
(28, 28, 1, '2026-05-15 10:47:16'),
(29, 30, 1, '2026-05-15 11:33:41'),
(30, 32, 1, '2026-05-16 15:24:40'),
(31, 1, 30, '2026-05-18 18:10:56'),
(37, 1, 18, '2026-05-19 21:04:04');

-- --------------------------------------------------------

--
-- Структура таблицы `tags`
--

CREATE TABLE `tags` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `tags`
--

INSERT INTO `tags` (`id`, `name`, `created_at`) VALUES
(3, 'React', '2026-03-28 18:25:27'),
(4, 'Js', '2026-03-28 18:25:27'),
(5, 'Разработка', '2026-03-28 18:25:27'),
(6, 'Frontend', '2026-03-28 18:25:27'),
(7, 'Backend', '2026-03-28 18:25:27'),
(8, 'PHP', '2026-03-28 18:25:27'),
(9, 'GO', '2026-03-28 18:25:27'),
(10, 'Python', '2026-03-28 18:25:27'),
(11, 'Design', '2026-03-28 18:25:27'),
(12, 'Figma', '2026-03-28 18:25:27'),
(13, 'UX/UI', '2026-03-28 18:25:27'),
(14, 'Дизайн', '2026-03-28 18:25:27'),
(15, 'Фронтенд', '2026-03-28 18:25:27'),
(16, 'Бэкенд', '2026-03-28 18:25:27'),
(17, 'Курс', '2026-03-28 18:25:27'),
(18, 'Туториал', '2026-03-28 18:25:27'),
(19, 'C#', '2026-03-28 18:25:27'),
(20, 'C++', '2026-03-28 18:25:27'),
(21, 'Веб-дизайн', '2026-03-28 18:25:27'),
(22, 'Web-design', '2026-03-28 18:25:27'),
(25, 'CSS', '2026-03-28 18:25:27'),
(26, 'Вёрстка', '2026-03-28 18:25:27'),
(28, 'Ревью', '2026-03-28 18:25:27'),
(31, 'DevOps', '2026-04-07 10:27:01');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT 0,
  `is_admin` tinyint(1) DEFAULT 0,
  `is_paid` tinyint(1) DEFAULT 0,
  `full_name` varchar(100) DEFAULT NULL,
  `avatar` varchar(255) DEFAULT 'default.png',
  `banner` varchar(255) DEFAULT NULL,
  `channel_created` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `name_reset` tinyint(1) DEFAULT 0,
  `premium_until` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`, `is_active`, `is_admin`, `is_paid`, `full_name`, `avatar`, `banner`, `channel_created`, `created_at`, `name_reset`, `premium_until`) VALUES
(1, 'kirusha', 'medvarik@gmail.com', '$2y$12$D.wU7HSbWOLFBjZhWoTZS.Iz.A8PgOg1A8y3Tc51yQFQOpTtltkGW', 1, 0, 1, 'Кируня', 'av_1_1774986631.jpg', 'bn_1_1774987052.jpg', 1, '2026-03-18 09:55:21', 0, '2026-10-10 21:51:02'),
(2, 'user6e0aefb1', 'igor@gmail.com', '$2y$10$c2BPN/v3ncfpqsGHUlkg5..vqfMaLyUAvUD/gyPrbvw2.IGWjvHIO', 0, 0, 0, 'user2', 'default.png', NULL, 1, '2026-03-23 09:05:51', 0, NULL),
(9, 'user09fda4b8', 'zelner04@gmail.com', '$2y$10$a.KKD6pYXR1etQntGaflJOEdUl2wv.Jn7s6aXKaKuz2kjF.oOrFAe', 1, 0, 0, 'user09fda4b8', 'default.png', NULL, 0, '2026-03-23 12:34:18', 0, NULL),
(16, 'admin', 'admin@gmail.com', '$2y$10$AhQleTS7KE9Dogvd/vvDjuOvLBGRfZOfiocPv1Ictnc3ZoeB/fv9y', 1, 1, 0, 'Админ', 'default.png', NULL, 0, '2026-03-26 11:38:57', 0, NULL),
(17, 'user_1303a6', 'new@gmail.com', '$2y$10$9lEQ3WKd.MKWEs6xEl7OwOtJ3KFqvjP14JqS9Tgxx.L9Gnybh9cHa', 1, 0, 1, 'user17', 'default.png', NULL, 1, '2026-03-28 18:33:01', 0, '2026-06-18 16:22:22'),
(18, 'первый', 'test@gmi.ocm', '$2y$10$aLVr6rk3ssa1xz0054lO6u4eOeOHGxvkBfD2XaNYyDyFvYDCCuhxm', 1, 0, 0, 'user18', 'default.png', NULL, 1, '2026-03-29 07:24:40', 0, NULL),
(19, 'user_e3c3a7', 'test@gmail.com', '$2y$10$p7imVTW2GtCfxcnpJ5RibOW/uILAibmeJKDwJFDCbk.iYs7MZffUm', 1, 0, 0, 'Иннокентий', 'default.png', NULL, 1, '2026-03-31 12:10:34', 0, NULL),
(20, 'user_3c6dd2', 'ex@gmail.com', '$2y$10$aI6ufPlYWwp3vqLar9MKIejUtge7TZPlGyJUi8NBSiDjEK5pLYGfe', 1, 0, 1, 'user20', 'default.png', NULL, 1, '2026-04-01 05:16:52', 1, '2026-06-12 23:03:06'),
(21, 'user_3e858e', 'ahyuitelniy@mail.ru', '$2y$10$w/h10VlvR0A1uPbSXK7UhOImsneZiBwZd6TgvbpUHojya2KC5/Jt.', 1, 0, 0, 'user21', 'default.png', NULL, 1, '2026-04-03 07:14:09', 1, NULL),
(22, 'meowmeow', 'meow@gmail.com', '$2y$10$y1Y0bNnFK9MNin235Lohe.WydHKxOjdZXQ9eFKaGt95z06JVFfdU2', 1, 0, 1, 'meow', 'av_22_1775545601.jpg', NULL, 1, '2026-04-07 07:03:35', 0, '2026-06-08 15:37:06'),
(23, 'egor4ik', 'egor4ik@gmail.com', '$2y$10$c8rTuBFPxQ2se7/oWU/Ixedbb5w4pcu1GlgsredO6eb4nkPkh30mG', 0, 0, 1, 'user23', 'av_23_1779802459.jpeg', 'bn_23_1775557675.jpg', 1, '2026-04-07 10:20:51', 0, '2026-06-08 21:09:41'),
(24, 'user_cdfdbd', 'kirushka@gmail.com', '$2y$10$2KD.9kYDDkyzIOxCpaO/veZNgFUxQIzHGVm9qQfq1kRpYf7rItSqG', 1, 0, 0, NULL, 'default.png', NULL, 1, '2026-04-28 08:19:07', 0, NULL),
(25, 'diodiodiodiodiodiodi', 'mail@iewr.ru', '$2y$10$.xXayArCAb1Dt8HzlSnJIuBE22I5Ra1q7dqwreUE0vOxAtVzUMy1e', 1, 0, 0, 'diodiodiodiodiodiodiodiodiodiodiodiodiod', 'av_25_1778329226.jpg', NULL, 1, '2026-05-09 12:08:25', 0, NULL),
(26, 'asd', 'asdf@gmail.com', '$2y$10$zBuyd7Ue6Q9HKx/L0ZWwZOzCzaa7TGd7/gILkrgB6tDQRhhYkqCM.', 1, 0, 1, 'мяу', 'default.png', NULL, 1, '2026-05-13 20:21:46', 0, '2026-06-14 12:09:51'),
(28, 'danonchik', 'negro@mail.com', '$2y$10$Fp9HGs/znyGEQhp3L9kWK.2vhwKzVHhNUnZ/75lWt8.F9mDom2hua', 0, 0, 1, 'danil', 'av_28_1778842139.png', 'bn_28_1778842352.jpeg', 1, '2026-05-15 10:44:41', 0, '2026-07-14 13:51:37'),
(30, 'igorechek', 'qwerty@gmail.com', '$2y$10$hs9iPneggVkMvzkVRYFQe.I0QdoeAdvcd56GQWGvijy8SXcUDlF1q', 1, 0, 1, 'user30', 'av_30_1778845011.jpg', NULL, 1, '2026-05-15 11:32:10', 0, '2026-07-14 14:39:18'),
(31, 'user_21c621', 'jdninc@gmail.com', NULL, 0, 0, 0, NULL, 'default.png', NULL, 0, '2026-05-15 12:11:13', 0, NULL),
(32, 'user_d39abc', 'aiaokidax@gmail.com', '$2y$10$4fq07.dpbyyX/RehYUkB6utrxEmxD8FRfdQyFrMJfn6BP2lGnD2OW', 1, 0, 1, '', 'av_32_1778945183.png', 'bn_32_1778945183.jpeg', 1, '2026-05-16 15:19:30', 0, '2026-06-15 18:22:36'),
(33, 'user_fed23b', 'scjnj@gmail.com', NULL, 0, 0, 0, NULL, 'default.png', NULL, 0, '2026-05-19 09:08:17', 0, NULL),
(34, 'user_24945f', 'sk@gmail.com', '$2y$12$75HRfdYU9XCq4FjZjEjdTeZv9bfeiqa8bFwFLEqEO8NGuu.ANuaV6', 1, 0, 0, NULL, 'default.png', NULL, 0, '2026-05-19 09:28:48', 0, NULL),
(35, 'user_840024', 'adjwd@gmail.com', NULL, 0, 0, 0, NULL, 'default.png', NULL, 0, '2026-05-19 11:22:04', 0, NULL),
(36, 'user_b79c3d', 'skfj@gmail.com', NULL, 0, 0, 0, 'user36', 'default.png', NULL, 0, '2026-05-19 11:38:11', 1, NULL),
(37, 'user_edca75', 'aoijd@gmail.com', NULL, 0, 0, 0, 'user37', 'default.png', NULL, 0, '2026-05-19 11:40:35', 1, NULL),
(38, 'user_7b349d', 'kira@company.ru', '$2y$12$3PKHVL4yaYCKija73zJc0uVu2lIKWYIbLkdZXaPxbpSYt4b.y7c6W', 1, 0, 1, NULL, 'default.png', NULL, 0, '2026-05-19 11:44:03', 0, '2026-06-20 18:46:44');

-- --------------------------------------------------------

--
-- Структура таблицы `videos`
--

CREATE TABLE `videos` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `video_url` varchar(255) NOT NULL,
  `thumbnail` varchar(255) DEFAULT NULL,
  `thumbnail_url` varchar(255) DEFAULT 'default_thumb.png',
  `views` int(11) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `videos`
--

INSERT INTO `videos` (`id`, `user_id`, `title`, `description`, `video_url`, `thumbnail`, `thumbnail_url`, `views`, `created_at`) VALUES
(1, 1, 'Тестовое видео', 'Описание ляляляляя', 'video_69ba91dc251838.35803172.MP4', '1775044808_218a91f88ffcc128f1ea63e7eb0c2d31.jpg', 'default_thumb.png', 27, '2026-03-18 11:51:56'),
(2, 1, 'новое видео', 'папапа', 'video_69ba93ea717676.82046284.MP4', '1775044790_f66cab915cfee40708a1b68eda25a27b.jpg', 'default_thumb.png', 30, '2026-03-18 12:00:42'),
(3, 2, 'видео игоря', 'новый видосик!', 'video_69c1076b9ff538.84626682.mp4', '1775047366_3d84e7399d349bce330ceebef955e1fa.jpg', 'default_thumb.png', 62, '2026-03-23 09:27:07'),
(4, 1, 'СуПЕР ИНТЕРЕСНОЕ ВИДЕООООО', 'хахаххахахахааха', 'video_69c13491032901.48797167.MP4', '1775044774_6d4b71fe0bc2932f2bdd6af16f7cb317.jpg', 'default_thumb.png', 31, '2026-03-23 12:39:45'),
(5, 1, 'мяу', 'мяумяу', 'video_69c27a697ab158.38714651.mkv', '1775044760_d0a48213cb739ba19c90ca33c46aa41b.jpg', 'default_thumb.png', 47, '2026-03-24 11:50:01'),
(7, 1, 'Разработка на реакте', 'оч интересно', 'video_69c6d5e22fd2e8.27235887.mp4', '1775044746_f850172d4bef0a11f33509b24b5c595a.jpg', 'default_thumb.png', 39, '2026-03-27 19:09:22'),
(8, 18, 'в', 'в', 'video_69c8d4a7cc8113.70513552.mkv', '1775047322_d66ea4eb57a848916ab4ae1f24844c7b.jpg', 'default_thumb.png', 32, '2026-03-29 07:28:39'),
(9, 18, 'фыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифы', 'фыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифыфыпыфорпифы', 'video_69c8d4bc778a89.67482313.mkv', '1775047311_a75a5dc66e911b16873fa50516e04561.jpg', 'default_thumb.png', 54, '2026-03-29 07:29:00'),
(10, 1, 'OPERATION TRUE LOVEEE <3', 'Потрясающая манхва', 'vid_69cc29d329d22_1774987731.mp4', 'thumb_69cc29d329d39_1774987731.jpg', 'default_thumb.png', 195, '2026-03-31 20:08:51'),
(11, 23, 'Не знаюНе знаю', 'очень интересно', 'vid_69d4db7a57927_1775557498.mkv', 'thumb_69d4db7a5793a_1775557498.jpg', 'default_thumb.png', 180, '2026-04-07 10:24:58'),
(12, 1, 'амам', 'мвмв', 'vid_69fdece974916_1778248937.mkv', 'thumb_69fdece9749f6_1778248937.png', 'thumb_69fdece9749f6_1778248937.png', 179, '2026-05-08 14:02:17'),
(26, 28, 'vze', 'fijfvjpivdaiphjdvhoiv', 'vid_6a06fa6681b69.mp4', 'thumb_6a06fa6681c84.jpg', 'thumb_6a06fa6681c84.jpg', 8, '2026-05-15 10:50:14'),
(27, 30, 'петр', '', 'vid_6a0705a197d32.mp4', 'thumb_6a0705a197e2a.jpeg', 'thumb_6a0705a197e2a.jpeg', 32, '2026-05-15 11:38:09'),
(28, 30, 'гнипнепнепнг', 'шгргрг8р8го', 'vid_6a070c5450775.mp4', 'thumb_6a070c54509d2.jpeg', 'thumb_6a070c54509d2.jpeg', 26, '2026-05-15 12:06:44'),
(29, 32, 'штрарушарту', 'аувщомшщвутрмга', 'vid_6a088d15b1496.mp4', 'thumb_6a088d15b1581.png', 'thumb_6a088d15b1581.png', 58, '2026-05-16 15:28:21');

-- --------------------------------------------------------

--
-- Структура таблицы `video_tags`
--

CREATE TABLE `video_tags` (
  `video_id` int(11) NOT NULL,
  `tag_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `video_tags`
--

INSERT INTO `video_tags` (`video_id`, `tag_id`) VALUES
(7, 3),
(7, 5),
(7, 26),
(8, 4),
(8, 7),
(8, 21),
(9, 4),
(10, 11),
(11, 7),
(11, 19),
(11, 20),
(12, 7),
(26, 10),
(26, 11),
(27, 7),
(28, 5);

-- --------------------------------------------------------

--
-- Структура таблицы `video_views_log`
--

CREATE TABLE `video_views_log` (
  `id` int(11) NOT NULL,
  `video_id` int(11) NOT NULL,
  `viewer_id` int(11) DEFAULT NULL,
  `viewed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `video_views_log`
--

INSERT INTO `video_views_log` (`id`, `video_id`, `viewer_id`, `viewed_at`) VALUES
(1, 10, NULL, '2026-04-01 10:06:13'),
(2, 10, NULL, '2026-04-01 10:06:16'),
(3, 10, NULL, '2026-04-01 10:06:17'),
(4, 10, NULL, '2026-04-01 10:06:18'),
(5, 10, NULL, '2026-04-01 10:06:20'),
(6, 9, NULL, '2026-04-01 11:01:18'),
(7, 9, NULL, '2026-04-01 11:01:19'),
(8, 9, NULL, '2026-04-01 11:01:20'),
(9, 9, NULL, '2026-04-01 11:01:21'),
(10, 9, NULL, '2026-04-01 11:01:22'),
(11, 9, NULL, '2026-04-01 11:01:23'),
(12, 9, NULL, '2026-04-01 11:01:24'),
(13, 9, NULL, '2026-04-01 11:01:26'),
(14, 9, NULL, '2026-04-01 11:01:27'),
(15, 9, NULL, '2026-04-01 11:01:28'),
(16, 9, NULL, '2026-04-01 11:01:29'),
(17, 9, NULL, '2026-04-01 12:05:26'),
(18, 9, NULL, '2026-04-01 12:11:42'),
(19, 8, NULL, '2026-04-01 12:11:43'),
(20, 2, NULL, '2026-04-01 12:47:33'),
(21, 4, NULL, '2026-04-01 12:59:24'),
(22, 1, NULL, '2026-04-01 12:59:26'),
(23, 10, NULL, '2026-04-01 13:06:41'),
(24, 7, NULL, '2026-04-01 13:06:43'),
(25, 1, NULL, '2026-04-01 13:06:45'),
(26, 10, NULL, '2026-04-01 13:06:53'),
(27, 10, NULL, '2026-04-01 13:06:55'),
(28, 10, NULL, '2026-04-01 13:06:56'),
(29, 10, NULL, '2026-04-01 13:06:57'),
(30, 10, NULL, '2026-04-01 13:06:58'),
(31, 10, NULL, '2026-04-01 13:07:00'),
(32, 10, NULL, '2026-04-01 13:07:02'),
(33, 10, NULL, '2026-04-01 13:07:03'),
(34, 10, NULL, '2026-04-01 13:11:38'),
(35, 7, NULL, '2026-04-01 13:11:40'),
(36, 5, NULL, '2026-04-01 13:11:42'),
(37, 10, NULL, '2026-04-01 13:19:23'),
(38, 10, NULL, '2026-04-02 11:18:26'),
(39, 10, NULL, '2026-04-02 11:18:27'),
(40, 10, NULL, '2026-04-02 11:18:28'),
(41, 10, NULL, '2026-04-02 11:18:29'),
(42, 10, NULL, '2026-04-02 11:18:30'),
(43, 10, NULL, '2026-04-02 11:18:31'),
(44, 10, NULL, '2026-04-03 07:14:45'),
(45, 10, NULL, '2026-04-03 07:14:57'),
(46, 10, NULL, '2026-04-03 07:14:59'),
(47, 10, NULL, '2026-04-06 10:29:35'),
(48, 10, NULL, '2026-04-07 07:04:30'),
(49, 9, NULL, '2026-04-07 07:04:31'),
(50, 10, NULL, '2026-04-07 07:04:33'),
(51, 10, NULL, '2026-04-07 07:04:35'),
(52, 10, NULL, '2026-04-07 07:08:29'),
(53, 10, NULL, '2026-04-07 10:21:41'),
(54, 10, NULL, '2026-04-07 10:21:43'),
(55, 10, NULL, '2026-04-07 10:21:44'),
(56, 10, NULL, '2026-04-07 10:21:48'),
(57, 10, NULL, '2026-04-07 10:22:40'),
(58, 11, NULL, '2026-04-07 10:25:00'),
(59, 11, NULL, '2026-04-28 08:20:06'),
(60, 10, NULL, '2026-04-28 08:20:09'),
(61, 11, NULL, '2026-04-28 11:38:22'),
(62, 11, NULL, '2026-05-07 07:32:59'),
(63, 10, NULL, '2026-05-07 07:33:12'),
(64, 11, NULL, '2026-05-07 07:46:28'),
(65, 9, NULL, '2026-05-07 07:53:27'),
(66, 9, NULL, '2026-05-07 07:53:31'),
(67, 12, 1, '2026-05-09 18:37:28'),
(68, 4, NULL, '2026-05-09 18:50:46'),
(69, 7, NULL, '2026-05-09 18:51:10'),
(70, 7, NULL, '2026-05-09 18:55:45'),
(71, 7, NULL, '2026-05-09 18:55:53'),
(72, 7, NULL, '2026-05-09 18:55:53'),
(73, 7, NULL, '2026-05-09 18:55:58'),
(74, 7, NULL, '2026-05-09 18:55:58'),
(75, 7, NULL, '2026-05-09 18:55:58'),
(76, 7, NULL, '2026-05-09 18:56:00'),
(77, 7, NULL, '2026-05-09 18:56:00'),
(78, 7, NULL, '2026-05-09 18:56:00'),
(79, 11, NULL, '2026-05-09 18:56:05'),
(80, 11, NULL, '2026-05-09 18:56:05'),
(81, 11, NULL, '2026-05-09 18:56:05'),
(82, 11, NULL, '2026-05-09 18:56:08'),
(83, 11, NULL, '2026-05-09 18:56:08'),
(84, 11, NULL, '2026-05-09 18:56:08'),
(85, 11, NULL, '2026-05-09 18:56:10'),
(86, 11, NULL, '2026-05-09 18:56:10'),
(87, 11, NULL, '2026-05-09 18:56:10'),
(88, 11, NULL, '2026-05-09 18:56:12'),
(89, 11, NULL, '2026-05-09 18:56:12'),
(90, 11, NULL, '2026-05-09 18:56:12'),
(91, 11, NULL, '2026-05-09 18:56:14'),
(92, 11, NULL, '2026-05-09 18:56:14'),
(93, 11, NULL, '2026-05-09 18:56:14'),
(94, 11, NULL, '2026-05-09 18:56:16'),
(95, 11, NULL, '2026-05-09 18:56:16'),
(96, 11, NULL, '2026-05-09 18:56:16'),
(97, 12, NULL, '2026-05-09 18:58:07'),
(98, 12, NULL, '2026-05-09 18:58:07'),
(99, 12, NULL, '2026-05-09 18:58:07'),
(100, 12, NULL, '2026-05-09 18:58:09'),
(101, 12, NULL, '2026-05-09 18:58:09'),
(102, 12, NULL, '2026-05-09 18:58:09'),
(103, 12, NULL, '2026-05-09 18:58:11'),
(104, 12, NULL, '2026-05-09 18:58:11'),
(105, 12, NULL, '2026-05-09 18:58:11'),
(106, 11, NULL, '2026-05-09 18:59:49'),
(107, 11, NULL, '2026-05-09 19:01:04'),
(108, 10, NULL, '2026-05-09 19:01:11'),
(109, 10, NULL, '2026-05-09 19:01:11'),
(110, 10, NULL, '2026-05-09 19:01:14'),
(111, 10, NULL, '2026-05-09 19:01:14'),
(112, 10, NULL, '2026-05-09 19:01:16'),
(113, 10, NULL, '2026-05-09 19:01:16'),
(114, 10, NULL, '2026-05-09 19:01:18'),
(115, 10, NULL, '2026-05-09 19:01:18'),
(116, 10, NULL, '2026-05-09 19:01:19'),
(117, 10, NULL, '2026-05-09 19:01:19'),
(118, 10, NULL, '2026-05-09 19:01:23'),
(119, 10, NULL, '2026-05-09 19:01:23'),
(120, 10, NULL, '2026-05-09 19:01:24'),
(121, 10, NULL, '2026-05-09 19:01:24'),
(122, 11, NULL, '2026-05-09 19:05:14'),
(123, 11, NULL, '2026-05-09 19:06:05'),
(124, 11, NULL, '2026-05-09 19:06:24'),
(125, 11, NULL, '2026-05-09 19:06:31'),
(126, 11, NULL, '2026-05-09 19:06:35'),
(127, 11, NULL, '2026-05-09 19:06:37'),
(128, 11, NULL, '2026-05-09 19:06:40'),
(129, 11, NULL, '2026-05-09 19:06:43'),
(130, 11, NULL, '2026-05-09 19:06:49'),
(131, 11, NULL, '2026-05-09 19:08:36'),
(132, 11, NULL, '2026-05-09 19:08:36'),
(133, 11, NULL, '2026-05-09 19:08:39'),
(134, 11, NULL, '2026-05-09 19:08:43'),
(135, 11, NULL, '2026-05-09 19:08:46'),
(136, 11, NULL, '2026-05-09 19:08:48'),
(137, 11, NULL, '2026-05-09 19:08:52'),
(138, 11, NULL, '2026-05-09 19:08:56'),
(139, 11, NULL, '2026-05-09 19:08:59'),
(140, 11, NULL, '2026-05-09 19:09:02'),
(141, 5, NULL, '2026-05-09 19:24:51'),
(142, 12, NULL, '2026-05-09 19:33:56'),
(143, 12, NULL, '2026-05-09 19:34:10'),
(144, 12, NULL, '2026-05-09 19:34:15'),
(145, 12, NULL, '2026-05-09 19:34:20'),
(146, 12, NULL, '2026-05-09 19:34:24'),
(147, 12, NULL, '2026-05-09 19:34:28'),
(148, 11, NULL, '2026-05-09 19:34:32'),
(149, 11, NULL, '2026-05-09 19:34:35'),
(150, 11, NULL, '2026-05-09 19:34:38'),
(151, 11, NULL, '2026-05-09 19:34:40'),
(152, 11, NULL, '2026-05-09 19:34:43'),
(153, 11, NULL, '2026-05-09 19:34:45'),
(154, 11, NULL, '2026-05-09 19:34:48'),
(155, 8, NULL, '2026-05-09 19:35:50'),
(156, 18, NULL, '2026-05-09 19:35:57'),
(157, 5, NULL, '2026-05-09 19:36:08'),
(158, 5, NULL, '2026-05-09 19:36:11'),
(159, 5, NULL, '2026-05-09 19:40:19'),
(160, 5, NULL, '2026-05-09 19:40:23'),
(161, 5, NULL, '2026-05-09 19:40:26'),
(162, 9, NULL, '2026-05-09 20:18:49'),
(163, 12, NULL, '2026-05-09 20:22:37'),
(164, 12, NULL, '2026-05-09 20:22:43'),
(165, 12, NULL, '2026-05-09 20:23:02'),
(166, 12, NULL, '2026-05-09 20:26:10'),
(167, 12, NULL, '2026-05-09 20:26:34'),
(168, 12, NULL, '2026-05-09 20:26:54'),
(169, 12, NULL, '2026-05-09 20:27:08'),
(170, 12, NULL, '2026-05-09 20:27:27'),
(171, 12, NULL, '2026-05-09 20:27:35'),
(172, 12, NULL, '2026-05-09 20:28:05'),
(173, 11, NULL, '2026-05-09 20:28:08'),
(174, 8, NULL, '2026-05-09 20:28:10'),
(175, 11, NULL, '2026-05-09 20:28:16'),
(176, 18, NULL, '2026-05-09 20:28:18'),
(177, 12, NULL, '2026-05-09 20:31:07'),
(178, 10, NULL, '2026-05-09 20:31:10'),
(179, 5, NULL, '2026-05-09 20:31:12'),
(180, 8, NULL, '2026-05-09 20:31:30'),
(181, 5, NULL, '2026-05-09 20:31:31'),
(182, 12, NULL, '2026-05-09 20:31:35'),
(183, 5, NULL, '2026-05-09 20:31:36'),
(184, 10, NULL, '2026-05-09 20:31:38'),
(185, 5, NULL, '2026-05-09 20:31:39'),
(186, 11, NULL, '2026-05-09 20:31:40'),
(187, 12, NULL, '2026-05-09 20:31:41'),
(188, 5, NULL, '2026-05-09 20:31:41'),
(189, 12, NULL, '2026-05-10 16:54:09'),
(190, 12, NULL, '2026-05-10 16:54:13'),
(191, 11, NULL, '2026-05-10 16:54:16'),
(192, 10, NULL, '2026-05-10 16:54:20'),
(193, 10, NULL, '2026-05-10 16:54:23'),
(194, 8, NULL, '2026-05-10 16:54:25'),
(195, 8, NULL, '2026-05-10 16:54:28'),
(196, 8, NULL, '2026-05-10 16:54:35'),
(197, 12, NULL, '2026-05-10 17:18:50'),
(198, 12, NULL, '2026-05-10 17:20:56'),
(199, 12, NULL, '2026-05-10 17:21:12'),
(200, 12, NULL, '2026-05-10 17:22:09'),
(201, 12, NULL, '2026-05-10 17:22:18'),
(202, 12, NULL, '2026-05-10 17:22:21'),
(203, 12, NULL, '2026-05-10 17:23:25'),
(204, 12, NULL, '2026-05-10 17:27:44'),
(205, 12, NULL, '2026-05-10 17:29:20'),
(206, 12, NULL, '2026-05-10 17:30:52'),
(207, 12, NULL, '2026-05-10 17:32:33'),
(208, 11, NULL, '2026-05-10 17:47:25'),
(209, 9, NULL, '2026-05-10 17:47:35'),
(210, 4, NULL, '2026-05-10 17:47:47'),
(211, 11, NULL, '2026-05-10 19:15:23'),
(212, 11, NULL, '2026-05-10 19:20:12'),
(213, 8, NULL, '2026-05-10 19:20:15'),
(214, 9, NULL, '2026-05-10 19:20:16'),
(215, 8, NULL, '2026-05-10 19:20:18'),
(216, 11, NULL, '2026-05-10 19:28:05'),
(217, 11, NULL, '2026-05-10 20:36:30'),
(218, 8, NULL, '2026-05-10 20:41:00'),
(219, 8, NULL, '2026-05-10 20:41:02'),
(220, 8, NULL, '2026-05-10 20:41:07'),
(221, 8, NULL, '2026-05-10 20:42:45'),
(222, 8, NULL, '2026-05-10 20:42:48'),
(223, 8, NULL, '2026-05-10 20:42:50'),
(224, 8, NULL, '2026-05-10 20:43:54'),
(225, 8, NULL, '2026-05-10 20:43:57'),
(226, 11, NULL, '2026-05-11 17:00:16'),
(227, 10, NULL, '2026-05-11 17:00:17'),
(228, 8, NULL, '2026-05-11 17:00:19'),
(229, 8, NULL, '2026-05-11 17:00:22'),
(230, 8, NULL, '2026-05-11 17:00:25'),
(231, 10, NULL, '2026-05-11 19:16:28'),
(232, 11, NULL, '2026-05-13 10:59:11'),
(233, 10, NULL, '2026-05-13 10:59:22'),
(234, 9, NULL, '2026-05-13 10:59:34'),
(235, 9, NULL, '2026-05-13 10:59:37'),
(236, 11, NULL, '2026-05-13 11:00:49'),
(237, 3, NULL, '2026-05-13 11:03:07'),
(238, 3, NULL, '2026-05-13 11:03:09'),
(239, 3, NULL, '2026-05-13 11:03:12'),
(240, 3, NULL, '2026-05-13 11:03:14'),
(241, 12, 1, '2026-05-13 11:21:43'),
(242, 12, 1, '2026-05-13 11:21:45'),
(243, 12, 1, '2026-05-13 11:21:45'),
(244, 12, 1, '2026-05-13 11:21:46'),
(245, 12, 1, '2026-05-13 11:21:46'),
(246, 12, 1, '2026-05-13 11:21:48'),
(247, 12, 1, '2026-05-13 11:21:48'),
(248, 12, 1, '2026-05-13 11:21:50'),
(249, 12, 1, '2026-05-13 11:21:50'),
(250, 12, 1, '2026-05-13 11:21:52'),
(251, 12, 1, '2026-05-13 11:21:52'),
(252, 12, 1, '2026-05-13 11:22:11'),
(253, 12, 1, '2026-05-13 11:22:11'),
(254, 12, 1, '2026-05-13 11:22:37'),
(255, 12, 1, '2026-05-13 11:22:48'),
(256, 12, 1, '2026-05-13 11:22:48'),
(257, 12, 1, '2026-05-13 11:22:50'),
(258, 12, 1, '2026-05-13 11:22:50'),
(259, 12, 1, '2026-05-13 11:22:51'),
(260, 12, 1, '2026-05-13 11:22:51'),
(261, 12, 1, '2026-05-13 11:22:53'),
(262, 12, 1, '2026-05-13 11:22:53'),
(263, 12, 1, '2026-05-13 11:22:55'),
(264, 12, 1, '2026-05-13 11:22:55'),
(265, 12, 1, '2026-05-13 11:23:08'),
(266, 12, 1, '2026-05-13 11:23:08'),
(267, 12, 1, '2026-05-13 11:23:11'),
(268, 12, 1, '2026-05-13 11:23:11'),
(269, 12, 1, '2026-05-13 11:24:30'),
(270, 12, 1, '2026-05-13 11:24:30'),
(271, 12, 1, '2026-05-13 11:26:16'),
(272, 12, 1, '2026-05-13 11:26:16'),
(273, 12, 1, '2026-05-13 11:26:18'),
(274, 12, 1, '2026-05-13 11:26:18'),
(275, 11, 1, '2026-05-13 11:49:43'),
(276, 11, 1, '2026-05-13 11:49:43'),
(277, 11, 1, '2026-05-13 11:49:47'),
(278, 11, 1, '2026-05-13 11:49:47'),
(279, 11, 1, '2026-05-13 11:49:49'),
(280, 11, 1, '2026-05-13 11:49:49'),
(281, 11, 1, '2026-05-13 11:49:51'),
(282, 11, 1, '2026-05-13 11:49:51'),
(283, 12, 1, '2026-05-13 11:49:57'),
(284, 12, 1, '2026-05-13 11:49:57'),
(285, 12, 1, '2026-05-13 11:50:00'),
(286, 12, 1, '2026-05-13 11:50:00'),
(287, 12, 1, '2026-05-13 11:50:01'),
(288, 12, 1, '2026-05-13 11:50:01'),
(289, 12, 1, '2026-05-13 11:50:04'),
(290, 12, 1, '2026-05-13 11:50:04'),
(291, 11, 1, '2026-05-13 11:50:07'),
(292, 11, 1, '2026-05-13 11:50:07'),
(293, 11, 1, '2026-05-13 11:50:09'),
(294, 11, 1, '2026-05-13 11:50:09'),
(295, 11, 1, '2026-05-13 11:50:11'),
(296, 11, 1, '2026-05-13 11:50:11'),
(297, 5, 1, '2026-05-13 11:50:20'),
(298, 5, 1, '2026-05-13 11:50:20'),
(299, 7, 1, '2026-05-13 11:50:21'),
(300, 7, 1, '2026-05-13 11:50:21'),
(301, 10, 1, '2026-05-13 11:50:22'),
(302, 10, 1, '2026-05-13 11:50:22'),
(303, 11, 1, '2026-05-13 11:50:23'),
(304, 11, 1, '2026-05-13 11:50:23'),
(305, 11, 1, '2026-05-13 11:50:33'),
(306, 11, 1, '2026-05-13 11:50:33'),
(307, 11, 1, '2026-05-13 11:52:22'),
(308, 11, 1, '2026-05-13 11:52:22'),
(309, 11, 1, '2026-05-13 11:52:26'),
(310, 11, 1, '2026-05-13 11:52:26'),
(311, 3, 1, '2026-05-13 11:52:35'),
(312, 3, 1, '2026-05-13 11:52:35'),
(313, 8, 1, '2026-05-13 11:52:44'),
(314, 8, 1, '2026-05-13 11:52:44'),
(315, 3, 1, '2026-05-13 11:52:54'),
(316, 3, 1, '2026-05-13 11:52:54'),
(317, 7, 1, '2026-05-13 11:53:01'),
(318, 7, 1, '2026-05-13 11:53:01'),
(319, 4, 1, '2026-05-13 11:53:03'),
(320, 4, 1, '2026-05-13 11:53:03'),
(321, 1, 1, '2026-05-13 11:53:05'),
(322, 1, 1, '2026-05-13 11:53:05'),
(323, 9, 1, '2026-05-13 11:53:32'),
(324, 9, 1, '2026-05-13 11:53:32'),
(325, 11, 1, '2026-05-13 11:53:33'),
(326, 11, 1, '2026-05-13 11:53:33'),
(327, 9, 1, '2026-05-13 11:53:45'),
(328, 9, 1, '2026-05-13 11:53:45'),
(329, 10, 1, '2026-05-13 11:53:48'),
(330, 10, 1, '2026-05-13 11:53:48'),
(331, 10, 1, '2026-05-13 11:53:50'),
(332, 10, 1, '2026-05-13 11:53:50'),
(333, 10, 1, '2026-05-13 12:08:37'),
(334, 10, 1, '2026-05-13 12:08:37'),
(335, 12, 1, '2026-05-13 15:06:09'),
(336, 12, 1, '2026-05-13 15:06:09'),
(337, 12, 1, '2026-05-13 15:06:34'),
(338, 12, 1, '2026-05-13 15:06:34'),
(339, 12, 26, '2026-05-13 20:37:29'),
(340, 12, 26, '2026-05-13 20:37:29'),
(341, 12, 26, '2026-05-14 07:35:15'),
(342, 12, 26, '2026-05-14 07:35:15'),
(343, 11, 26, '2026-05-14 07:35:21'),
(344, 11, 26, '2026-05-14 07:35:21'),
(345, 10, 1, '2026-05-14 07:39:20'),
(346, 10, 1, '2026-05-14 07:39:20'),
(347, 10, 1, '2026-05-14 07:41:22'),
(348, 10, 1, '2026-05-14 07:41:34'),
(349, 10, 1, '2026-05-14 07:41:55'),
(350, 10, 1, '2026-05-14 07:41:59'),
(351, 10, 1, '2026-05-14 07:42:02'),
(352, 10, 1, '2026-05-14 07:42:02'),
(353, 10, 1, '2026-05-14 07:42:58'),
(354, 10, 1, '2026-05-14 07:42:58'),
(355, 12, 27, '2026-05-14 07:46:05'),
(356, 12, 27, '2026-05-14 07:46:05'),
(357, 11, 27, '2026-05-14 07:46:12'),
(358, 11, 27, '2026-05-14 07:46:12'),
(359, 24, 27, '2026-05-14 10:44:26'),
(360, 24, 27, '2026-05-14 10:44:26'),
(361, 23, 27, '2026-05-14 10:44:29'),
(362, 23, 27, '2026-05-14 10:44:29'),
(363, 23, 27, '2026-05-14 10:44:34'),
(364, 23, 27, '2026-05-14 10:44:34'),
(365, 23, 27, '2026-05-14 11:13:55'),
(366, 23, 27, '2026-05-14 11:13:55'),
(367, 24, 16, '2026-05-14 11:25:05'),
(368, 24, 16, '2026-05-14 11:25:05'),
(369, 24, 16, '2026-05-14 11:25:13'),
(370, 23, 16, '2026-05-14 11:25:24'),
(371, 23, 16, '2026-05-14 11:25:37'),
(372, 23, 16, '2026-05-14 11:25:37'),
(373, 24, 16, '2026-05-14 11:25:37'),
(374, 24, 27, '2026-05-14 11:30:32'),
(375, 24, 27, '2026-05-14 11:30:32'),
(376, 24, 27, '2026-05-14 11:30:35'),
(377, 24, 27, '2026-05-14 11:30:35'),
(378, 24, 27, '2026-05-14 11:30:38'),
(379, 24, 27, '2026-05-14 11:30:38'),
(380, 22, 27, '2026-05-14 11:30:43'),
(381, 22, 27, '2026-05-14 11:30:43'),
(382, 22, 27, '2026-05-14 11:30:46'),
(383, 22, 27, '2026-05-14 11:30:46'),
(384, 24, 27, '2026-05-14 11:31:51'),
(385, 24, 27, '2026-05-14 11:31:51'),
(386, 24, 27, '2026-05-15 07:29:13'),
(387, 24, 27, '2026-05-15 07:29:13'),
(388, 24, 27, '2026-05-15 07:29:19'),
(389, 24, 27, '2026-05-15 07:29:19'),
(390, 24, 27, '2026-05-15 07:52:54'),
(391, 24, 27, '2026-05-15 07:52:54'),
(392, 23, 27, '2026-05-15 07:52:55'),
(393, 23, 27, '2026-05-15 07:52:55'),
(394, 22, 27, '2026-05-15 07:53:04'),
(395, 22, 27, '2026-05-15 07:53:04'),
(396, 24, 27, '2026-05-15 08:39:00'),
(397, 24, 27, '2026-05-15 08:39:00'),
(398, 24, 27, '2026-05-15 08:39:02'),
(399, 24, 27, '2026-05-15 08:39:02'),
(400, 31, NULL, '2026-05-21 09:04:25'),
(401, 31, NULL, '2026-05-21 09:04:25'),
(402, 31, NULL, '2026-05-21 09:04:26'),
(403, 31, NULL, '2026-05-21 09:04:26'),
(404, 31, NULL, '2026-05-21 09:04:27'),
(405, 31, NULL, '2026-05-21 09:04:27'),
(406, 31, NULL, '2026-05-21 09:04:28'),
(407, 31, NULL, '2026-05-21 09:04:28'),
(408, 29, NULL, '2026-05-21 09:04:29'),
(409, 29, NULL, '2026-05-21 09:04:29'),
(410, 29, NULL, '2026-05-21 09:04:30'),
(411, 29, NULL, '2026-05-21 09:04:30'),
(412, 29, NULL, '2026-05-21 09:04:32'),
(413, 29, NULL, '2026-05-21 09:04:32'),
(414, 29, NULL, '2026-05-21 09:04:34'),
(415, 29, NULL, '2026-05-21 09:04:34'),
(416, 29, NULL, '2026-05-21 09:04:36'),
(417, 29, NULL, '2026-05-21 09:04:36'),
(418, 29, NULL, '2026-05-21 09:04:37'),
(419, 29, NULL, '2026-05-21 09:04:37'),
(420, 29, NULL, '2026-05-21 09:04:38'),
(421, 29, NULL, '2026-05-21 09:04:38'),
(422, 11, NULL, '2026-05-21 10:06:37'),
(423, 11, NULL, '2026-05-21 10:06:37'),
(424, 11, NULL, '2026-05-21 10:25:13'),
(425, 11, NULL, '2026-05-21 10:25:13'),
(426, 11, NULL, '2026-05-21 10:30:04'),
(427, 11, NULL, '2026-05-21 10:30:04'),
(428, 11, NULL, '2026-05-21 10:30:07'),
(429, 11, NULL, '2026-05-21 10:30:07'),
(430, 11, NULL, '2026-05-21 10:31:10'),
(431, 11, NULL, '2026-05-21 10:31:10'),
(432, 11, NULL, '2026-05-21 10:35:24'),
(433, 11, NULL, '2026-05-21 10:35:24'),
(434, 12, NULL, '2026-05-21 10:47:44'),
(435, 12, NULL, '2026-05-21 10:47:44'),
(436, 31, NULL, '2026-05-21 13:24:02'),
(437, 31, NULL, '2026-05-21 13:24:02'),
(438, 10, NULL, '2026-05-26 13:35:08'),
(439, 10, NULL, '2026-05-26 13:35:08'),
(440, 12, NULL, '2026-05-26 13:35:17'),
(441, 12, NULL, '2026-05-26 13:35:17'),
(442, 12, NULL, '2026-05-26 13:35:50'),
(443, 12, NULL, '2026-05-26 13:35:52'),
(444, 12, NULL, '2026-05-26 13:35:52'),
(445, 29, NULL, '2026-05-28 09:36:37'),
(446, 29, NULL, '2026-05-28 09:36:37'),
(447, 29, NULL, '2026-05-28 09:36:41'),
(448, 10, NULL, '2026-05-28 09:42:09'),
(449, 10, NULL, '2026-05-28 09:42:09');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `video_id` (`video_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `email_verifications`
--
ALTER TABLE `email_verifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `email` (`email`);

--
-- Индексы таблицы `playlists`
--
ALTER TABLE `playlists`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `playlist_saves`
--
ALTER TABLE `playlist_saves`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_user_playlist` (`user_id`,`playlist_id`),
  ADD KEY `fk_ps_playlist` (`playlist_id`);

--
-- Индексы таблицы `playlist_videos`
--
ALTER TABLE `playlist_videos`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_video_in_playlist` (`playlist_id`,`video_id`),
  ADD KEY `video_id` (`video_id`);

--
-- Индексы таблицы `promo_codes`
--
ALTER TABLE `promo_codes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`),
  ADD KEY `promo_codes_ibfk_1` (`used_by`);

--
-- Индексы таблицы `promo_usages`
--
ALTER TABLE `promo_usages`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `one_use_per_user` (`promo_id`,`user_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `reports`
--
ALTER TABLE `reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `reporter_id` (`reporter_id`);

--
-- Индексы таблицы `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`setting_key`);

--
-- Индексы таблицы `subscriptions`
--
ALTER TABLE `subscriptions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_sub` (`follower_id`,`followed_id`),
  ADD KEY `followed_id` (`followed_id`);

--
-- Индексы таблицы `tags`
--
ALTER TABLE `tags`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Индексы таблицы `videos`
--
ALTER TABLE `videos`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_user_video` (`user_id`);

--
-- Индексы таблицы `video_tags`
--
ALTER TABLE `video_tags`
  ADD PRIMARY KEY (`video_id`,`tag_id`),
  ADD KEY `tag_id` (`tag_id`);

--
-- Индексы таблицы `video_views_log`
--
ALTER TABLE `video_views_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `video_id` (`video_id`),
  ADD KEY `viewed_at` (`viewed_at`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `email_verifications`
--
ALTER TABLE `email_verifications`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- AUTO_INCREMENT для таблицы `playlists`
--
ALTER TABLE `playlists`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=90;

--
-- AUTO_INCREMENT для таблицы `playlist_saves`
--
ALTER TABLE `playlist_saves`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT для таблицы `playlist_videos`
--
ALTER TABLE `playlist_videos`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=646;

--
-- AUTO_INCREMENT для таблицы `promo_codes`
--
ALTER TABLE `promo_codes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT для таблицы `promo_usages`
--
ALTER TABLE `promo_usages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `reports`
--
ALTER TABLE `reports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT для таблицы `subscriptions`
--
ALTER TABLE `subscriptions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT для таблицы `tags`
--
ALTER TABLE `tags`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT для таблицы `videos`
--
ALTER TABLE `videos`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT для таблицы `video_views_log`
--
ALTER TABLE `video_views_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=450;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_ibfk_1` FOREIGN KEY (`video_id`) REFERENCES `videos` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `comments_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `email_verifications`
--
ALTER TABLE `email_verifications`
  ADD CONSTRAINT `email_verifications_ibfk_1` FOREIGN KEY (`email`) REFERENCES `users` (`email`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `playlists`
--
ALTER TABLE `playlists`
  ADD CONSTRAINT `playlists_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `playlist_saves`
--
ALTER TABLE `playlist_saves`
  ADD CONSTRAINT `fk_ps_playlist` FOREIGN KEY (`playlist_id`) REFERENCES `playlists` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_ps_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `playlist_videos`
--
ALTER TABLE `playlist_videos`
  ADD CONSTRAINT `playlist_videos_ibfk_1` FOREIGN KEY (`playlist_id`) REFERENCES `playlists` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `playlist_videos_ibfk_2` FOREIGN KEY (`video_id`) REFERENCES `videos` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `promo_codes`
--
ALTER TABLE `promo_codes`
  ADD CONSTRAINT `promo_codes_ibfk_1` FOREIGN KEY (`used_by`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `promo_usages`
--
ALTER TABLE `promo_usages`
  ADD CONSTRAINT `promo_usages_ibfk_1` FOREIGN KEY (`promo_id`) REFERENCES `promo_codes` (`id`),
  ADD CONSTRAINT `promo_usages_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `reports`
--
ALTER TABLE `reports`
  ADD CONSTRAINT `reports_ibfk_1` FOREIGN KEY (`reporter_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `subscriptions`
--
ALTER TABLE `subscriptions`
  ADD CONSTRAINT `subscriptions_ibfk_1` FOREIGN KEY (`follower_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `subscriptions_ibfk_2` FOREIGN KEY (`followed_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `videos`
--
ALTER TABLE `videos`
  ADD CONSTRAINT `fk_user_video` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `video_tags`
--
ALTER TABLE `video_tags`
  ADD CONSTRAINT `video_tags_ibfk_1` FOREIGN KEY (`video_id`) REFERENCES `videos` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `video_tags_ibfk_2` FOREIGN KEY (`tag_id`) REFERENCES `tags` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
